import Image from 'next/image';
import { useRouter } from 'next/router';
import { useEffect, useState } from 'react';

const images = [
  {
    id: 0,
    tag: 'Art',
    images: ['1.png', '1.1.1.png', '1.2.png','1.3.png'],
    place: 'Iconsiam (ชั้น 6)',
    title: 'Van Gogh Alive Bangkok',
    description: ['Van Gogh Alive Bangkok จัดขึ้นในคอนเซ็ปต์ I dream my painting, and then I paint my dream สะท้อน',
    'ความสำคัญของศิลปะที่มีต่อชีวิตของ Van Gogh',
    'พื้นที่จัดแสดงแบ่งเป็น 3 โซนหลักๆ โซนแรก Exhibition Zone มีนิทรรศการแนะนำประวัติของ Van Gogh ต่อด้วย โซนไฮไลต์อย่าง Gallery Hall ที่รวบรวมผลงานมาสเตอร์พีซทั้งภาพเขียน ภาพสเก็ตช์ ภาพพิมพ์ ที่ Van Gogh สร้างสรรค์ขึ้นในช่วงปี 1880-1890 มาจัดแสดงในรูปแบบ Immersive Multi-Sensory Experience โดยจะถูกฉายลงบนพื้นและกำแพงขนาดสูง 6 เมตร โซนที่ 3 เป็น Van Gogh Old Town เมืองเล็กๆ ที่จำลองมาจากผลงาน Van Gogh แบ่งเป็น 4 ธีมคือ Fields, Starry Night, Countryside และ Garden และโซนสุดท้าย ใครอยากแสดงฝีมือก็ยังมีพื้นที่กิจกรรมวาดภาพและมีร้านขายของที่ระลึกให้ซื้อกลับบ้านอีกด้วย'],
    location: 'Iconsiam (ชั้น 6)',
    date: 'ตั้งแต่วันที่ 31 มีนาคม - 31 กรกฎาคม 2566',
    time: '10.00 – 22.00 น.',
    ticket: [
    { type: 'VIP', price: '1,490 บาท' },
    { type: 'ทั่วไป', price: '990 บาท' },
    { type: 'Early Bird', price: '690 บาท (ใช้ได้ถึง 30 เม.ย. 2566) ' },
    { type: 'นักเรียน/นักศึกษา', price: '480 บาท' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    '- BTS สะพานตากสิน',
    ' ลง BTS สะพานตากสิน แล้วออกที่ทางออกประตู 2 หลังจากนั้นสามารถเดินมาขึ้นเรือที่ท่าเรือสาทรเพื่อต่อ Shuttle Boat (ฟรี) เรือออกทุก 10 นาที',
    '- BTS สายสีทอง',
    ' รถ BTS สายสีทองเปิดให้บริการ ตั้งแต่เวลา 06.00-24.00 มี 4 สถานี ได้แก่ สถานีกรุงธนบุรี สถานีเจริญนคร สถานีคลองสาน และสถานีประชาธิปก (ยังไม่เปิดให้บริการ)',
    'สามารถนั่งสถานีใดก็ได้มาลงสถานีเจริญนคร เมื่อลงจากสถานีแล้วจะเจอทางเชื่อมกับไอคอนสยามพอดี',
    'จุดเชื่อม BTS สายสีทองกับสายอื่น ๆ ได้แก่',
    '- BTS สายสีเขียว: BTS สีลม เชื่อมต่อจาก BTS กรุงธนบุรี',
    '- BTS สายสีม่วง: ตั้งแต่เตาปูน - ราษฎร์บูรณะ ต่อกับ BTS ประชาธิปก',
    '- BTS สายสีแดง: ตั้งแต่หัวลำโพง - บางบอน - มหาชัย เชื่อมต่อกับ BTS คลองสาน'
    ]
    },
    {type: 'MRT',
    directions: [
    '- MRT หัวลำโพง',
    'หลังจากลงที่ MRT หัวลำโพง แล้วใช้ทางออกประตูที่ 1 โดยหลังจากที่ออกประตูที่ 1 ให้เลี้ยวซ้ายไปถนนมหาพฤฒาราม เดินเรียบคลองมาเรื่อย ๆ จะเจอสามแยก เลือกเดินตรงไปก็จะเจอสี่แยกไฟแดงสี่พระยา ให้เลี้ยวขวาไปถนนสี่พระยา เดินตรงมาเรื่อย ๆ จะเจอท่าเรือข้ามฟากสี่พระยา ทั้งหมดเป็นระยะทางประมาณ 1.3 กม. แล้วนั่งเรือฟรีไปลงไอคอนสยาม',
    '- MRT สีลม',
    'หลังจากลงที่ MRT สีลมแล้วให้นั่งต่อไปที่ BTS ศาลาแดง แล้วลง BTS สะพานตากสิน แล้วต่อเรือฟรี'
    ]
    },
    {type: 'เรือ',
    directions: [
    'สามารถมาท่าเรือต่อไปนี้เพื่อนั่ง Shuttle boat ไปไอคอนสยามโดยตรง',
    'ท่าเรือสาทร ให้บริการตั้งแต่เวลา 08.00-23.30 น.',
    'ท่าเรือสี่พระยา ให้บริการตั้งแต่เวลา 09.00-23.00 น.',
    '*Shuttle Boat จะออกทุก 10 นาที ตั้งแต่เวลา 09.00-23.00 น.'
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'สำหรับการขึ้นรถเมล์ไปไอคอนสยามมีทั้งหมด 11 เส้นทาง ได้แก่ 3, 6, 84, ปอ.84, 88, 89, 105, 111, 120, 149, 167, 177',
    'สาย 3: หมอชิตใหม่ – คลองสาน รถให้บริการทั้งคืน',
    'สาย 6: พระประแดง – บางลำพู เดินรถตั้งแต่ 05:00 - 20:00 น.',
    'สาย 84: อ้อมใหญ่ – สถานีรถไฟฟ้าวงเวียนใหญ่ รถให้บริการทั้งคืน',
    'สาย ปอ.84: วัดไร่ขิง - สถานีรถไฟฟ้าวงเวียนใหญ่',
    'สาย 88: อาคารสงเคราะห์ - ถ.กรุงธนบุรี เดินรถตั้งแต่ 05:00 - 22:00 น. *รถน้อย',
    'สาย 111: วงกลมเจริญนคร – ตลาดพลู เดินรถตั้งแต่ 05:00 - 20:00 น.',
    'สาย 149: อู่พุทธมณฑสาย2 – ส.ขนส่งผู้โดยสารกรุงเทพ(เอกมัย) เดินรถตั้งแต่ 05:00 - 22:00 น.',
    'สาย 167: คลองสาย – ถ.กาญจน์ฯ-บางขุนเทียน เดินรถตั้งแต่ 05:00 - 21:00 น. *รถน้อย',
    'สาย 177: วงกลมบางบัวทอง – วงเวียนใหญ่-อนุเสาวรีย์ชัยสมรภูมิ เดินรถตั้งแต่ 05:00 - 22:00 น. *รถน้อย',
    'สายที่ลงฝั่งตรงข้ามไอคอนสยาม ได้แก่',
    'สาย 89: สวนลุมพินี – ตลิ่งชัน สายนี้จะอ้อมนิดหน่อย เดินรถตั้งแต่ 05:00 - 23:00 น.',
    'สาย 105: มหาชัยเมืองใหม่ - สะพานสมเด็จพระเจ้าตากสิน รถให้บริการทั้งคืน',
    'สาย 120: อู่ทองหลาง – ราชพฤกษ์ รถให้บริการทั้งคืน'
    ]
    }
    ]
    },
    {
      id: 1,
      tag: 'Art',
      images: ['2.png', '2.1.png', '2.2.png','2.3.png'],
      place: 'The Jim Thompson Art Center ชั้น 3 Gallery 1',
      title: 'Utopia Now',
      description: ['ผลงานของ Kay Walkowiak ศิลปินชาวออสเตรีย นิทรรศการจะพาทุกคนร่วมเดินทางไปกับ "ผี" ในร่างของนักแสดงและศิลปินสื่อแสดงสดของ ธีรวัฒน์ คาเงะ มุลวิไล ที่เข้าสำรวจสถานที่เก่าแก่ทิ้งร้าง พร้อมเปิดพื้นที่ทางจินตนาการสำหรับการคิดถึงอนาคตของโลก "screen" และรูปทรงนามธรรมทรงเลขคณิตที่ปรากฏซ้ำที่ขยายประเด็นความยุติธรรมในอนาคตให้ครอบคลุมถึงชีวิตที่ไม่ใช่มนุษย์'],
      location: 'The Jim Thompson Art Center ชั้น 3 Gallery 1',
      date: 'ตั้งแต่วันที่ 11 มีนาคม – 30 มิถุนายน 2566',
      time: '10.00 – 18.00 น. (ปิดวันอังคาร)',
      ticket: [
      { type: 'ผู้ใหญ่', price: '50 บาท' },
      ],
      waytogo: [
        {type: 'BTS',
    directions: [
    'มาลงที่สถานีสนามกีฬาแห่งชาติ W1 (BTS National stadium Station exit1) ออกทางออกที่ 1 เมื่อลง',
    'มาจากสถานีให้เลี้ยวซ้าย เดินตรงไปที่ซอยเกษมสันต์ 2 เข้าไปจนสุดซอย พิพิธภัณฑ์บ้านจิม ทอมป์สัน อยู่ด้านซ้ายมือ',
    ]
    }
    ]
    },

    {
      id: 2,
      tag: 'Art',
      images: ['3.1.jpg','3.5.jpg','3.2.jpg','3.3.jpg'],
      place: 'ศูนย์การประชุมแห่งชาติสิริกิติ์ ชั้น B2',
      title: 'Between BAB',
      description: ['เทศกาลศิลปะร่วมสมัยนานาชาติ “บางกอก อาร์ต เบียนนาเล่” โดย มูลนิธิ บางกอก อาร์ต เบียนนาเล่ ร่วมกับ บริษัท ไทยเบฟเวอเรจ จำกัด (มหาชน) จัดงานนิทรรศการ “Between BAB” นำเสนอบทสรุปของเทศกาล ศิลปะร่วมสมัยบางกอก อาร์ต เบียนนาเล่ BAB 2018, 2020 และ 2022 ที่ย้อนรำลึก 6 ปี โดยคัดสรรผลงานศิลปะกว่า 60 ชิ้นงาน โดย 29 ศิลปินจากทั่วโลก ที่เคยร่วมจัดแสดง ภายใต้หัวข้อ “สุขสะพรั่ง พลังอาร์ต” “ศิลป์สร้าง ทางสุข” และ “โกลาหล : สงบสุข” ซึ่งรวบรวมผลงานบางชิ้นจากคอลเลกชั่นสะสมของมูลนิธิ บางกอก อาร์ต เบียนนาเล่ศาสตราจารย์ ดร.อภินันท์ โปษยานนท์ ในนามประธานอำนวยการและผู้อำนวยการศิลป์ บางกอก อาร์ต เบียนนาเล่ ให้ข้อมูลว่า “นิทรรศการ BETWEEN BAB เป็นหนึ่งในโปรแกรมของเทศกาลบางกอก อาร์ต เบียนนาเล่ ที่มุ่งมั่นสนับสนุนการเรียนรู้ผ่านศิลปะ  และส่งเสริมวัฒนธรรมการชื่นชมและเข้าใจในศิลปะร่วมสมัย ให้กับชุมชนคนรักศิลปะในไทย และผู้ที่สนใจมาเยี่ยมชมศูนย์การประชุมแห่งชาติสิริกิติ์   นอกจากนี้เรายังมีโปรแกรมการศึกษาของงานบางกอก อาร์ต เบียนนาเล่ ประกอบด้วย BAB Academy คอร์สเรียนศิลปะ โปรแกรมอบรม DEK BAB เช่น กิจกรรมนำชม กิจกรรมออนไลน์ และอื่นๆอีกมากมาย เป็นการพัฒนาเศรษฐกิจอย่างสร้างสรรค์  และเพิ่มโอกาสที่ชุมชนจะได้มีประสบการณ์ เกี่ยวกับศิลปะ และขับเคลื่อนระบบนิเวศศิลปะ  โดยผลงานศิลปะจะสามารถสร้างการรับรู้และแรงบันดาลใจ เกี่ยวกับประเด็นต่างๆได้มากมาย ไม่ว่าจะเป็นเรื่อง การอพยพพลัดถิ่น วิกฤตผู้ลี้ภัยและสงคราม ความเหลื่อมล้ำทางสังคม และภัยพิบัติสิ่งแวดล้อม เป็นต้น '],
      location: 'ศูนย์การประชุมแห่งชาติสิริกิติ์ ชั้น B2',
      date: 'ตั้งแต่วันที่ 24 มีนาคม – 30 มิถุนายน 2566',
      time: '11.00 – 20.00 น. (พุธ - อาทิตย์)',
      ticket: [
      {type: 'ทุกคน', price: 'ฟรี' },
      ],
      waytogo: [
        {type: 'MRT',
    directions: [
    'ศูนย์ประชุมสิริกิติ์',
    ]
    }
    ]
    },

    {
      id: 3,
      tag: 'Art',
      images: ['4.jpg','4.1.jpg','4.2.jpg','4.3.jpg'],
      place: 'The Jim Thompson Art Center ชั้น 3 Gallery 1',
      title: 'Uncountable Time',
      description: ['เวลาที่นับไม่ได้ นิทรรศการกลุ่มโดยศิลปินไทย นนทวัฒน์ นําเบญจพล และ กฤตภัทธ์ ฐานสันโดษ, รุ่งเรือง สิทธิฤกษ์, และ วิริยะ โชติปัญญาวิสุทธิ์ สร้างสรรค์ผลงานวิดีโอ, ภาพถ่าย, และผลงานจัดวาง ที่อ้างอิงถึงแนวคิด “Duration” หรือ เวลาที่ไม่สามารถนับได้ ทำให้เห็นถึงประวัติศาสตร์ที่ไม่ได้เป็นเพียงแค่การจดบันทึก แต่ยังรวมถึงความทรงจำส่วนตัวที่ความเจ็บปวดได้ฝังไว้ในจิตสำนึกของผู้ถูกกระทำ รวมถึงความเข้มข้นของความรู้สึก, ความสูญเสีย, ความเจ็บปวด, และความทุกข์ ที่ผุดขึ้นฉับพลันจากความทรงจำ ณ ขณะใดก็ตามที่อดีตถูกกระตุ้น โดยไม่สอดคล้องกับการไหลไปของเวลาที่เกิดจากการเคลื่อนของวัตถุบนปริภูมิ ไม่อยู่ในอดีต ปัจจุบัน หรือ อนาคต แต่อยู่ในจิตสำนึก เวลาที่นับไม่ได้ทำหน้าที่รักษาอดีต ใช้สร้างเรื่องราวที่ซับซ้อนขึ้นจากจิตสำนึกต่อเจตจำนงค์ของการตัดสินใจให้กับปัจจุบันและอนาคต รวมถึงช่วยในการคาดการณ์สิ่งที่จะเกิดขึ้นให้แตกต่างไป ความแตกต่างทำให้มีเสรีภาพ เพราะเราสามารถมีทางเลือกและสร้างหรือทำให้เกิดกระบวนการกลายไปเป็นสิ่งอื่น เวลาที่นับไม่ได้ในจิตสำนึกเป็นการยืดเยื้อและยังคงเคลื่อนจากอดีตเข้าสู่ปัจจุบัน ที่ที่อดีตของเราทุกคนกลายมาเป็นประวัติศาสตร์ขนาดใหญ่ เป็นอันหนึ่งอันเดียวกันในความซับซ้อนนี้ผลงานของศิลปินนำเสนอเวลาของจิตสำนึกกับผลที่หลงเหลือจากช่วงสงครามเย็นและยังคงดำเนินต่อมาจนปัจจุบัน นนทวัฒน์ และ กฤตภัทธ์ เล่าเรื่องราวที่ถูกกดไว้ด้วยการกระทำของผู้มีอำนาจผ่านผลงานวิดีโอ, วิริยะ แสดงภาพถ่ายอันคลุมเครือของสิ่งที่ปรากฏอยู่รายรอบเราในชีวิตประจำวัน ต่างจากการมีอยู่ของภาพถ่ายที่มักจะแสดงความจริงอย่างชัดเจน, ผลงานจัดวางของรุ่งเรือง สร้างงานจากความทรงจำของน้า ที่ทำงานขับรถส่งผลไม้จากเหนือมากรุงเทพฯ ชีวิตที่อยู่บนโครงสร้างและทิศทางอย่างถนน กลายมาเป็นความทรงจำหรืออดีตที่เป็นตัวกำหนดเจตจำนงของชีวิต'],
      location: 'The Jim Thompson Art Center ชั้น 3 Gallery 1',
      date: 'ตั้งแต่วันที่ 11 มีนาคม – 30 มิถุนายน 2566',
      time: '10.00 – 18.00 น. (ปิดวันอังคาร)',
      ticket: [
      { type: 'ผู้ใหญ่', price: '50 บาท' },
      ],
      waytogo: [
        {type: 'BTS',
    directions: [
    'มาลงที่สถานีสนามกีฬาแห่งชาติ W1 (BTS National stadium Station exit1) ออกทางออกที่ 1 เมื่อลง',
    'มาจากสถานีให้เลี้ยวซ้าย เดินตรงไปที่ซอยเกษมสันต์ 2 เข้าไปจนสุดซอย พิพิธภัณฑ์บ้านจิม ทอมป์สัน อยู่ด้านซ้ายมือ',
    ]
    }
    ]
    },

    {
    id: 4,
    tag: 'Museum',
    images: ['5.1.jpg', '5.2.jpg', '5.3.jpg','5.4.jpg'],
    place: 'ท้องฟ้าจำลอง',
    title: 'ท้องฟ้าจำลอง',
    description: ' ‘ท้องฟ้าจำลอง’ แหล่งเรียนรู้อีกแห่งที่ตั้งอยู่ใน ‘ศูนย์วิทยาศาสตร์เพื่อการศึกษา’ (Science Centre for Education) ซึ่งศูนย์การเรียนรู้แห่งนี้ประกอบด้วยนิทรรศการหลายอาคารด้วยกัน แต่ที่โดดเด่นและเป็นที่รู้จักคือ ‘ห้องฉายดาว’ ที่มีเครื่องฉายดาวขนาดใหญ่ตั้งอยู่ตรงกลางห้องฉายดาวเป็นห้องทรงกลมหลังคาโดมซึ่งเปรียบเสมือนโลก และหลังคาโดมนี้ยังทำหน้าที่เสมือนหน้าจอภาพยนตร์ขนาดยักษ์ที่รองรับดวงดาวนับล้านดวงบนระบบสุริยะ ดวงดาวและกาแล็กซี่ที่ปรากฏบนหน้าจอจำลองมาจากท้องฟ้ายามค่ำคืนที่ให้ความรู้สึกเสมือนจริง โดยมีการบรรยายเรื่องราวแบบเรียลไทม์ ช่วยสร้างความตื่นเต้นและให้ความรู้แบบไม่น่าเบื่อไปพร้อมกัน',  
    location: 'ท้องฟ้าจำลอง',
    date: 'วันอังคาร - วันอาทิตย์',
    time: '09.00 – 16.00 น.',
    ticket: [
    { type: 'ผู้ใหญ่', price: '30 บาท' },
    { type: 'เด็ก', price: '20 บาท' }
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS เอกมัยทางออก 2',
    ]
    }
    ]
    },

    {
    id: 5,
    tag: 'Museum',
    images: ['6.jpg', '6.1.jpg', '6.2.jpg','6.4.jpg'],
    place: 'พิพิธภัณฑสถานแห่งชาติพระนคร',
    title: 'พิพิธภัณฑสถานแห่งชาติพระนคร',
    description: 'พิพิธภัณฑสถานแห่งชาติ พระนคร ตั้งอยู่บริเวณ “พระราชวังบวรสถานมงคล” หรือ “วังหน้า” สร้างขึ้นเมื่อ พ.ศ.2325 ในคราวเดียวกับพระบรมมหาราชวัง พระราชวังแห่งนี้เคยเป็นที่ประทับของพระมหาอุปราชถึง 5 พระองค์ ในสมัยรัชกาลที่ 5 ได้ยกเลิกตำแหน่งพระมหาอุปราช พระราชวังแห่งนี้จึงว่างลง จึงโปรดเกล้าฯให้ “มิวเซียมหลวง” ณ ศาลาสหทัยสมาคมหรือหอคองคอเดีย ในพระบรมมหาราชวังมาตั้งแสดงสมัยรัชกาลที่ 7 โปรดเกล้าฯ พระราชทานพระราชมณเฑียรสถานในพระราชวังสถานมงคลทั้งหมดจัดตั้งเป็น “พิพิธภัณฑสถานสำหรับพระนคร” และประกาศตั้งเป็น “พิพิธภัณฑสถานแห่งชาติ พระนคร” เมื่อปี พ.ศ.2477 การจัดแสดงแบ่งเป็นเรื่อง ประวัติศาสตร์แห่งแผ่นดิน, ประณีตศิลป์สืบสมัย, ประวัติศาสตร์ศิลป์ไทยสืบสาน และโบราณสถานวังหน้า',
    location: 'พิพิธภัณฑสถานแห่งชาติพระนคร',
    date: 'วันพุธ-วันอาทิตย์ และวันหยุดนักขัตฤกษ์ (ยกเว้นเทศกาลปีใหม่และสงกรานต์',
    time: '09.00 – 16.00 น.',
    ticket: [
    { type: 'คนไทย', price: '30 บาท' },
    { type: 'ชาวต่างชาติ', price: '200 บาท' },
    { type: 'เด็ก / นักเรียน / นักศึกษา / ผู้สูงอายุ 60 ปีขึ้นไป / พระสงฆ์ / สมาชิก ICOM ICOMOS (แสดงบัตร)', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'MRT',
    directions: [
    'MRT สถานีสนามไชย',
    'ทางออกประตู 1 มิวเซียมสยาม และเดินไปทางสนามหลวง หรือสามารถนั่งรถเมล์สาย 53 ต่อไปได้เลย',
    ]
    },
    {type: 'เรือ',
    directions: [
    'เรือด่วนเจ้าพระยา ลงท่าช้าง เดินตัดมหาวิทยาลัยธรรมศาสตร์เข้ามาก็จะถึงพิพิธภัณฑ์',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 3 , 6 , 9 , 19 , 30 , 33 , 43 ,  53 , 59 , 64 , 65 , 70 , 80 , 82 , 91 , 123 , 124 , 201 , 503 , 506 , 507 , A2',
    ]
    }
    ]
    },

    {
    id: 6,
    tag: 'Museum',
    images: ['7.2.jpg', '7.3.png', '7.jpg','7.4.jpg'],
    place: 'Museum of Contemporary Art',
    title: 'Museum of Contemporary Art',
    description: 'พิพิธภัณฑ์ศิลปะไทยร่วมสมัย (Museum of Contemporary Art) หรือที่รู้จักกันในชื่อ MOCA  ที่นี่ได้รวบรวมบันทึกประวัติศาสตร์ไทยที่น่าสนใจผ่านภาพผลงานศิลปะทั้งไทยร่วมสมัย สร้างสรรค์โดยศิลปินไทยชั้นครูที่มีชื่อเสียงมากมาย และศิลปะตะวันตกที่จัดแสดงในส่วนของห้อง Richard Green หน้าพิพิธภัณฑ์มีงานประติมากรรม โดยนำหินทั้งก้อนมาแกะสลักอย่างประณีตเป็นลายก้านมะลิ ซึ่งบ่งบอกถึงเอกลักษณ์ความเป็นไทยได้เป็นอย่างดี นอกจากนี้ตัวอาคารยังทำช่องแสงให้เป็นลายฉลุ ให้แสงลอดเข้ามาในตึกอย่างสร้างสรรค์ ก่อให้เกิดมิติแห่งอารมณ์ที่แตกต่างกันในแต่ละช่วงของวัน แถมยังมีจุดต่าง ๆ ที่น่าไปถ่ายรูป เก็บบรรยากาศคูลๆ มุมเจ๋งๆ ในพิพิธภัณฑ์อีกด้วย ',
    location: 'Museum of Contemporary Art',
    date: 'วันอังคาร - วันอาทิตย์',
    time: '10.00 – 18.00 น.',
    ticket: [
    { type: 'ผู้ใหญ่', price: '280 บาท' },
    { type: 'นักเรียน/นักศึกษา (แสดงบัตร) ', price: '120 บาท' },
    { type: 'เด็กอายุต่ำกว่า 13 ปี', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีเกษตรศาสตร์',
    'ต่อรถประจำทาง หรือรถรับจ้าง',
    ]
    },
    {type: 'MRT',
    directions: [
    'MRT สวนจตุจักร',
    'ต่อรถประจำทาง หรือรถรับจ้าง',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 29, 69, 134, 187, 191, 504, 510, 55 ลงป้ายสถานีปรมณู 1',
    ]
    }
    ]
    },

    {
    id: 7,
    tag: 'Museum',
    images: ['8.1.jpg', '8.2.jpg', '8.3.jpg','8.jpg'],
    place: 'Museum Siam',
    title: 'Museum Siam',
    description: 'มิวเซียมสยาม ชวนร่วมสัมผัสมิวเซียมสยามโฉมใหม่ พร้อมนิทรรศการถาวรชุดใหม่ ในชื่อ"ถอดรหัสไทย" ที่จะพาทุกคนไปเรียนรู้ พัฒนาการความเป็น "ไทย" ตั้งแต่อดีตถึงปัจจุบัน จากบริบททางสังคมที่เปลี่ยนแปลงไปตามยุคสมัย ผ่านนิทรรศการที่มีรูปแบบการนำเสนอที่แปลกใหม่ อาทิ เทคโนโลยี สื่อผสมเรื่องราวการพัฒนาชาติไทย ห้องครัวมีชีวิตที่จะพาไปเรียนรู้เรื่องราวของอาหารไทยผ่านโมชั่นกราฟิก และห้องเรียนเสมือนจริง ที่พาย้อนไปยังห้องเรียนในยุคอดีต โดยจุดเด่นของนิทรรศการอยู่ที่รูปแบบการนำเสนอและการเล่าเรื่องผ่านเรื่องราว วัตถุจัดแสดง ที่ปัจจุบันทันสมัย สามารถพบเห็นได้ทั่วไป เพื่อชวนให้ผู้เข้าชมสามารถผูกโยงเข้ากับเรื่องราวในอดีตได้',
    location: 'Museum Siam',
    date: 'วันอังคาร - วันอาทิตย์',
    time: '10.00 – 18.00 น.',
    ticket: [
    { type: 'ผู้ใหญ่คนไทย', price: '100 บาท' },
    { type: 'ผู้ใหญ่ชาวต่างชาติ', price: '100 บาท' },
    { type: 'นักเรียน/นักศึกษา (แสดงบัตร) ', price: '50 บาท' },
    { type: 'เข้าชมเป็นกลุ่ม(จำนวน 5 คนขึ้นไป)', price: 'รับส่วนลด 50%' },
    { type: 'เยาวชนไทย/ต่างชาติ อายุต่ำกว่า 15 ปี ผู้สูงอายุ 60 ปีขึ้นไป นักบวช ผู้พิการ/ทุพพลภาพ มัคคุเทศน์ ', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีบางหว้า',
    'ต่อรถไฟฟ้า MRT สถานีบางหว้า มาที่สถานีสนามไชย',
    'BTS สถานีศาลาแดง',
    'ต่อรถไฟฟ้า MRT สถานีสีลม มาที่สถานีสนามไชย',
    ]
    },
    {type: 'MRT',
    directions: [
    'MRT สนามไชย',
    'ทางออกที่ 1',
    ]
    },
    {type: 'เรือ',
    directions: [
    'ลงท่าเรือ “ยอดพิมาน” เดินออกมาจนเจอถนนใหญ่แล้วข้ามถนน เดินตรงผ่านสน.พระราชวัง แล้วจะเห็นมิวเซียมสยามอยู่ทางซ้ายมือ',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'ป้ายมิวเซียมสยาม : สาย 3 / 9 / 48(3-11) / 82 ',
    'ป้ายปากคลองตลาด : สาย 3 / 7ก / 8(2-38) / 9 / 42 / 53 / 73 / 82',
    'ป้ายโรงเรียนราชินี : สาย 47 / 53 / 82',
    'ป้ายสำนักงานที่ดิน : สาย 3 / 6(4-1) / 9 / 12 / 48(3-11) / 53 / 82'
    ]
    }
    ]
    },

    {
    id: 8,
    tag: 'Park',
    images: ['12.1.jpg', '12.2.jpg', '12.3.jpg','12.4.jpg'],
    place: 'สวนหลวง ร.9',
    title: 'สวนหลวง ร.9',
    description: '  สวนหลวง ร.9 เป็นสวนสาธารณะและสวนพฤกษศาสตร์ที่ใหญ่ที่สุดในกรุงเทพฯ มีพื้นที่กว่า 500 ไร่ ซึ่งแน่นอนว่าก็ทำให้มีกิจกรรมมากมายให้เราได้ผ่อนคลายกัน ทั้ง วิ่ง ปั่นจักรยานน้ำ และยังเหมาะสำหรับเดินเล่นเที่ยวชมธรรมชาติ ชมนก ชมไม้อีกด้วย นอกจากนี้ภายในสวนยังมีสระน้ำ สวนหย่อม ไว้ให้เพลิดเพลินไปกับพันธุ์ไม้หลากหลายชนิด ทั้งไม้ดอก ไม้ประดับ และไม้ที่หายาก แต่ถ้ามาช่วงธันวาคมจะมีงานพรรณไม้งามอร่ามสวนหลวง การประดับตกแต่งสวนด้วยดอกไม้เมืองหนาว มีซุ้มดอกไม้ต่างๆ ให้ถ่ายรูป ถือว่าเป็นงานใหญ่ประจำปีของสวนหลวง ร.9 เลยทีเดียว',
    location: 'สวนหลวง ร.9',
    date: 'เปิดทุกวัน',
    time: '05.00 – 19.00 น.',
    ticket: [
    { type: 'บุคคล', price: '10 บาท' },
    { type: 'รถยนต์ (คัน)', price: '50 บาท' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีอุดมสุข',
    'ต่อรถสองแถวลงหน้าสวนหลวง ร.9',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'สาย 11 : อู่เมกาบางนา-สนามกีฬาแห่งชาติ',
    'สาย 133 : วัดธาตุทอง-การเคหะฯ (บางพลี)',
    'สาย 206 : อู่เมกาบางนา-ม.เกษตรศาสตร์',
    'สาย 207 : แยกแฮปปี้แลนด์-ต่างระดับศรีเอี่ยม',
    ]
    }
    ]
    }, 

    {
    id: 9,
    tag: 'Park',
    images: ['11.1.jpg', '11.2.jpg', '11.3.jpg','11.jpg'],
    place: 'สวนสมเด็จพระนางเจ้าสิริกิติ์',
    title: 'สวนสมเด็จพระนางเจ้าสิริกิติ์',
    description: 'สวนสมเด็จพระนางเจ้าสิริกิติ์ สวนสาธารณะ ใจกลางเมืองที่มีพื้นที่ 196 ไร่ เป็นแหล่งรวบรวมพันธุ์พืชท้องถิ่น พันธุ์ไม้ในพระนาม พันธุ์ไม้จากพระตำหนักต่างๆ และพันธุ์ไม้ต่างประเทศที่น่าสนใจไว้มากมายค่ะ นอกจากนี้ ที่นี่ยังมีลานบัว ซึ่งเป็นลานพักผ่อนตกแต่งด้วยบ่อน้ำรูปดอกบัวขนาดยักษ์ ที่รวมพันธุ์บัวทั้งไทยและต่างประเทศ อีกทั้งยังมีสวนยุโรป สามารถเดินชมความงดงามได้แบบชิลๆ สัมผัสความเป็นธรรมชาติได้ชิลสุดๆ รวมถึงอาจจะได้เห็นสัตว์ตัวน้อยออกมาทักทาย โดยเฉพาะกระรอก ที่มาอาศัยอยู่ในสวนแห่งนี้ด้วย',
    location: 'สวนสมเด็จพระนางเจ้าสิริกิติ์',
    date: 'เปิดทุกวัน',
    time: '05.00 – 19.00 น.',
    ticket: [
    { type: 'ทุกคน', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีหมอชิต',
    'ทางออก 1 หรือ 3 เดินผ่านสวนจตุจักรไปยังสวนสมเด็จพระนางเจ้าสิริกิติ์ หรือนั่งวินมอเตอร์ไซค์ไปทางถนนกำแพงเพชร 2',
    ]
    },
    {type: 'MRT',
    directions: [
    'MRT สวนจตุจักร',
    'ทางออก 1 หรือ 2 เดินขึ้นไปสามารถเดินผ่านสวนจตุจักรไปยังสวนสมเด็จพระนางเจ้าสิริกิติ์ หรือนั่งวินมอเตอร์ไซค์',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 77, 104, 136, 138, 145'
    ]
    }
    ]
    },

    {
    id: 10,
    tag: 'Park',
    images: ['9.5.png', '9.2.jpg', '9.3.jpg', '9.1.jpg'],
    place: 'สวนเบญจกิติ',
    title: 'สวนเบญจกิติ',
    description: 'สวนเบญจกิติ สวนสาธารณะใจกลางกรุงเทพฯ ที่มีพื้นที่ให้คนกรุงได้พักผ่อนหย่อนใจ 191 ไร่ มีทางวิ่งรอบสระน้ำ รวมถึงมีเลนจักรยานแยกอีกด้วยค่ะ ทำให้ไม่ต้องห่วงเรื่องอันตราย สำหรับคนที่ไปวิ่งและเดินภายในสวน อีกทั้งยังมีบึงน้ำขนาดใหญ่ มีสวนสวย ๆ มีทางเดินให้เดินเล่นหรือออกกำลังกายด้วย และยังแบ่งออกเป็นส่วนต่างๆ ให้ผู้คนได้เข้ามาใช้ทำกิจกรรมอื่น ๆ ด้วย เช่น ลานเบญจกิติ ลานการแสดงกลางแจ้ง สวนสุขภาพ ศาลาพักผ่อน ในพื้นที่ธรรมชาติที่มีลมพัดมาเป็นระยะ ๆ มองออกไปเห็นตึกสูงรายล้อม มีต้นไม้สีเขียวๆ ให้ดูกันเพลินๆ เป็นสถานที่ออกกำลังกายสงบ ๆ ใจกลางเมือง',
    location: 'สวนเบญจกิติ',
    date: 'เปิดทุกวัน',
    time: '05.30 – 21.00 น.',
    ticket: [
    { type: 'ทุกคน', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีอโศก',
    'ทางออก 4 แล้วเลี้ยวขวา เดินมุ่งหน้าไปทางศูนย์การประชุมแห่งชาติสิริกิติ์ ทางเข้าสวนจะอยู่ตรงข้ามกับอาคารโอเชี่ยน ทาวเวอร์ 1',
    ]
    },
    {type: 'MRT',
    directions: [
    'MRT ศูนย์การประชุมแห่งชาติสิริกิติ์',
    'ทางออก 3',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 45, 46, 109, 115, 116, ปอ.22, ปอ.185, ปอ. 507'
    ]
    }
    ]
    },    

    {
    id: 11,
    tag: 'Park',
    images: ['10.jpg','10.4.jpg','10.2.jpg','10.3.jpg'],
    place: 'สวนลุมพินี',
    title: 'สวนลุมพินี',
    description: 'สวนลุมพินี อีกหนึ่งพื้นที่สีเขียวตั้งอยู่ใจกลางเมือง เป็นจุดพักผ่อนหย่อนใจของทั้งชาวกรุงเทพฯ และชาวต่างชาติ อีกทั้งสวนลุมพินียังนับเป็นสวนสาธารณะแห่งแรกของประเทศไทย และเป็นปอดขนาดใหญ่ของชาวกรุง บนพื้นที่กว่า 360 ไร่ ทำให้ที่นี่ร่มรื่นด้วยต้นไม้ขนาดใหญ่ ภายในสวนมีสวนปาล์มร่มรื่น สระน้ำขนาดใหญ่ มีจักรยานน้ำ และเรือพายให้เช่า รวมถึงยังเป็นจุดนัดพบของชมรมเพื่อสุขภาพ และมีศูนย์กิจกรรมกีฬา ทำให้สวนลุมพินีเป็นที่พบปะสังสรรค์ พักผ่อน ออกกำลังกาย ที่สำคัญของคนเมือง',
    location: 'สวนลุมพินี',
    date: 'เปิดทุกวัน',
    time: '04.30 – 21.00 น.',
    ticket: [
    { type: 'ทุกคน', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'BTS',
    directions: [
    'BTS สถานีศาลาแดง',
    'ทางออก 6 และเดินข้ามถนนพระราม 4 ไปยังบริเวณพระบรมราชานุสรณ์ พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว ซึ่งทางเข้าสวนจะอยู่ไม่ไกลจากจุดนั้น',
    ]
    },
    {type: 'MRT',
    directions: [
    'MRT สถานีสีลม',
    'ทางออก 1',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 4, 13, 45, 46, 47, 50, 74, 17, 115, 116, 22, 109'
    ]
    }
    ]
    },

    {
    id: 12,
    tag: 'Local Markets',
    images: ['15.1.jpg', '15.2.jpg', '15.3.jpg','15.4.jpg'],
    place: 'ตลาดเก่าริมน้ำหัวตะเข้',
    title: 'ตลาดเก่าริมน้ำหัวตะเข้',
    description: 'ตลาดเก่าหัวตะเข้ เดิมมีชื่อว่า “ตลาดเก่าเรือนไม้ หลวงพรต-ท่านเลี่ยม” ตั้งตามชื่อของผู้บริจาคที่ดินผืนนี้ให้สร้างตลาดริมคลองประเวศบุรีรมย์ ส่วนที่มาของชื่อ ชุมชมหัวตะเข้ นั้นมาจากการที่เมื่อก่อนบริเวณนี้จระเข้ชุกชุม จึงได้นำมาเป็นชื่อเรียกจนถึงทุกวันนี้ ภายในตลาดเก่าหัวตะเข้ จะมีร้านค้า และร้านโชห่วยมากมาย รวมถึงร้านอาหาร และคาเฟ่ให้ได้ไปนั่งสัมผัสบรรยากาศอันร่มรื่นริมคลอง บางร้านก็จะตกแต่งแบบร่วมสมัย คือมีการใส่กิมมิกของศิลปะสมัยใหม่สอดคล้องกับทรงร้านแบบโบราณดั้งเดิม ทำให้ดูมีเสน่ห์ไปอีกแบบ ยิ่งเดินเข้าไปตามทางก็จะพบกับงานศิลปะแบบ กราฟิติ (Grafiti)  และสตรีทอาร์ตมากมายตามกำแพง ผืนผ้าใบ และกระดานไม้ โดยเฉพาะรูป จระเข้สีเขียว ซึ่งเป็นหนึ่งในไฮไลท์ของที่นี่เลยค่ะ ถือเป็นการสร้างสีสันให้กับชุมชน และเป็นจุดที่สามารถไปถ่ายรูปเท่ๆ ได้อีกด้วย',
    location: 'ตลาดเก่าริมน้ำหัวตะเข้',
    date: 'เปิดทุกวัน',
    time: '10.00 – 18.00 น.',
    ticket: [
    { type: 'ทุกคน', price: 'ฟรี' },
    ],
    waytogo: [
    {type: 'Airport Rail Link',
    directions: [
    'สถานีลาดกระบัง',
    'ต่อรถสองแถวไปยังตลาดหัวตะเข้ ต้องเลือกรถสองแถวที่เขียนว่าไปมีนบุรี',
    ]
    },
    {type: 'รถประจำทาง',
    directions: [
    'รถเมล์สาย 143, 151, 517'
    ]
    }
    ]
    },
    
    {
      id: 13,
      tag: 'Local Markets',
      images: ['13.1.jpg', '13.2.jpg', '13.3.jpg','13.4.jpg'],
      place: 'ตลาดน้อย',
      title: 'ตลาดน้อย',      
      description: 'ตลาดน้อยนับเป็นชุมชนจีนเก่าแก่แห่งหนึ่งของกรุงเทพฯ ก่อตั้งมาตั้งแต่สมัยตอนต้นกรุงรัตนโกสินทร์ จุดเด่นของชุมชนตลาดน้อยคือความสโลว์ไลฟ์ ใครชอบเดินเล่น ถ่ายรูปกับกำแพงเก่าสวยๆ มีสตรีทอาร์ทเก๋ๆ ต้องรักที่นี่แน่นอน นอกจากเดินเล่นถ่ายรูปแล้วยังมีศาลเจ้าปึงเถ่ากงม่าให้คุณได้แวะสักการะเพื่อความเป็นสิริมงคล แถมยังมีร้านอร่อยๆ มากมาย คาเฟ่ก็น่ารัก เดินเล่นเพลินๆ ได้ทั้งวัน เป็น one day trip กรุงเทพที่เพอร์เฟ็คสุดๆ',
      location: 'ตลาดน้อย',
      date: 'เปิดทุกวัน',
      time: '10.00 – 21.00 น.',
      ticket: [
      { type: 'ทุกคน', price: 'ฟรี' },
      ],
      waytogo: [
      {type: 'BTS',
      directions: [
      'สถานีสะพานตากสิน',
      'ต่อเรือลงท่ากรมเจ้าท่า',
      ]
      },
      {type: 'MRT',
      directions: [
      'สถานีหัวลำโพง',
      'ทางออก 1 แล้วต่อรถเมล์ 1, 35, 75',
      ]
      },
      {type: 'เรือ',
      directions: ['ลงท่ากรมเจ้าท่า'
      ]
      },
      {type: 'รถประจำทาง',
      directions: [
      'รถเมล์สาย 1, 35, 75'
      ]
      }
      ]
      },

      {
      id: 14,
      tag: 'Local Markets',
      images: ['16.1.jpg', '16.2.jpg', '16.3.jpg','16.4.jpg'],
      place: 'ตลาดคลองบางหลวง',
      title: 'ตลาดคลองบางหลวง', 
      description: 'ลัดเลาะไปยังย่านริมคลองบางกอกใหญ่ คุณจะได้พบกับชุมชนริมน้ำเก่าแก่ที่ก่อตั้งมาตั้งแต่สมัยอยุธยากับชุมชนคลองบางหลวง เมื่อก้าวย่างเข้าไปจะเห็นตึกไม้เก่าทรงคลาสสิกที่ตั้งเรียงรายอยู่ทั้ง 2 ฝั่งริมคลอง มีลมเย็นพัดเอื่อยเข้าปะทะร่างกายทำให้รู้สึกคลายร้อนจากอากาศที่กำลังระอุได้เป็นอย่างดี ใครที่ชื่นชอบเที่ยวชุมชน ดูวิถีชีวิตเก่าๆ ของชาวบ้านต้องมาเดินเล่นที่นี่ มีร้านน่ารักให้ได้เดิมชม ทั้งร้านขายของฝาก ร้านตัดผมเก่าไปจนถึงร้านอาหารอร่อยๆ นอกจากนี้ต้องไม่พลาดมานั่งจิบกาแฟยามบ่ายที่บ้านศิลปิน เสพงานศิลป์ นั่งดูสายน้ำไหลเอื่อยๆ ไม่มีอะไรชิลล์ไปกว่าที่นี่แล้วล่ะ',
      location: 'ตลาดคลองบางหลวง',
      date: 'เปิดทุกวัน',
      time: '10.00 – 21.00 น.',
      ticket: [
      { type: 'ทุกคน', price: 'ฟรี' },
      ],
      waytogo: [
      {type: 'BTS',
      directions: [
      'สถานีบางหว้า',
      'ทางออก 3 หรือ 4 เดินไปยังท่าเรือบางหว้าจะมีเรือฟรีกทม. สามารถไปลงคลองบางหลวงได้เลย',
      ]
      },
      {type: 'เรือ',
      directions: ['ลงท่าคลองบางหลวง'
      ]
      },
      {type: 'รถประจำทาง',
      directions: [
      'รถเมล์สาย 12, 183, 3, 32, 35, 42' 
      ]
      }
      ]
      },

      {
      id: 15,
      tag: 'Local Markets',
      images: ['14.jpg', '14.1.jpg', '14.2.jpg','14.3.jpg'],
      place: 'ชุมชนเสาชิงช้า',
      title: 'ชุมชนเสาชิงช้า', 
      description: 'อีกหนึ่งที่เที่ยว one day trip กรุงเทพที่น่าชวนเดอะแก๊งมาเดินเล่นชมเมืองคือย่านชิงช้าหรือหนึ่งในที่เที่ยวไฮไลท์ของกรุงเทพฯ กับสัญลักษณ์เสาชิงช้าที่ใครๆ ก็ต้องรู้จัก นอกเหนือจากเสาชิงช้าแล้ว ในย่านนี้ยังมีตรอกซอกซอยเล็กๆ ให้คุณได้สะพายกล้องไปถ่ายรูป เดินเล่นย่านสามแพร่ง ซึ่งประกอบด้วยแพร่งนรา แพร่งภูธรและแพร่งสรรพศาสตร์ มีร้านอาหารอร่อยๆ ให้คุณได้ลิ้มลอง ไม่ว่าจะเป็นร้านชื่อดังอย่างมนต์นมสด ร้านมิตรโกหย่วน อาหารจีนสไตล์ไหหลำ ช่วงเย็นๆ ยิ่งอากาศดี นั่งเล่นตรงลานคนเมือง เก็บบรรยากาศของเสาชิงช้ายามเย็นแล้วค่อยเดินไปถ่ายรูปต่อที่อนุสาวรีย์ประชาธิปไตย',
      location: 'ชุมชนเสาชิงช้า',
      date: 'เปิดทุกวัน',
      time: 'Always open',
      ticket: [
      { type: 'ทุกคน', price: 'ฟรี' },
      ],
      waytogo: [
      {type: 'BTS',
      directions: [
      'สถานีอนุสาวรีย์ชัยสมรภูมิ',
      'ต่อรถเมล์สาย 12',
      ]
      },
      {type: 'MRT',
      directions: [
      'สถานีสามยอด',
      'ทางออก 3 เจอธนาคารกรุงเทพสาขาสามยอดเดินตรง บนถนนอุณากรรณสวนทางทิศด้านที่สวนทางรถไปเรื่อย ๆ สักพักจะพบกับทางแยกที่กลับรถได้ ยังคงเดินตรงไปตามทิศเดิม (ตอนนี้จะกลายเป็นตามทางรถแล้ว เพราะเป็นทางกลับรถ',
      'จะพบกับโรงเรียนวัดสุทัศน์อยู่ทางด้านซ้าย ตามมาด้วยทางเข้าวัดสุทัศน์',
      'หากเดินตรงมาเรื่อย ๆ และเลี้ยวซ้าย จะพบกับเสาชิงช้า และศาลาว่าการกรุงเทพมหานคร'
      ]
      },
      {type: 'รถประจำทาง',
      directions: [
      'รถเมล์สาย 12, 183, 30, 32, 35, 42, 44' 
      ]
      }
      ]
      },

  // Add more images with their respective tags, places, titles, and descriptions
  // ...
];

const ImageDetailPage = () => {
  const router = useRouter();
  const { id } = router.query;

  const [titleVisible, setTitleVisible] = useState(false);

  useEffect(() => {
    const handleScroll = () => {
      const isTitleVisible = window.scrollY > 100;
      setTitleVisible(isTitleVisible);
    };

    window.addEventListener('scroll', handleScroll);

    return () => {
      window.removeEventListener('scroll', handleScroll);
    };
  }, []);

  const image = images.find((img) => img.id === Number(id));

  if (!image) {
    return <div>Loading...</div>;
  }

  return (
    <div className="relative min-h-screen">
      <div className="fixed top-0 left-0 right-0 z-50 text-center bg-white py-4 font-bold text-3xl">
        {titleVisible && image.title}
      </div>
      <div className="flex flex-col justify-center items-center min-h-screen py-12">
        <div className="max-w-3xl p-4 bg-gray-100 rounded-lg shadow-lg">
          <div className="grid grid-cols-1 md:grid-cols-2 gap-4 mb-4">
            {image.images.map((img, index) => (
              <div key={index}>
                <Image
                  src={`/images/${img}`}
                  alt={image.title}
                  width={500}
                  height={300}
                  className="object-cover rounded-lg shadow-lg"
                />
              </div>
            ))}
          </div>
          <div className="text-center">
            <h1 className="text-3xl font-semibold mb-2">{image.title}</h1>
            <h1 className="text-xl font-semibold">About</h1>
            <p className="text-gray-600 mb-6 mt-2">{image.description}</p>
            <div className="text-gray-800">
              <p>
                <span className="font-bold">Location:</span> {image.place}
              </p>
              <p className='mt-6'>
                <span className="font-bold">Way to Go</span>
              </p>
              {image.waytogo.map((way, index) => (
                <div key={index}>
                  <p className="font-bold mt-2">{way.type}</p>
                  {way.directions.map((direction, index) => (
                    <p key={index}>{direction}</p>
                  ))}
                </div>
              ))}
            </div>
          </div>
        </div>
      </div>
      <footer className="bg-gray-200 py-2 px-4 text-gray-800 text-sm ">
        <div className="mx-64 flex justify-between items-center">
          <div>
            <p className="font-bold">Location:</p>
            <p>{image.location}</p>
          </div>
          <div>
            <p className="font-bold">Date:</p>
            <p>{image.date}</p>
          </div>
          <div>
            <p className="font-bold">Time:</p>
            <p>{image.time}</p>
          </div>
          <div>
            <p className="font-bold">Ticket:</p>
            <ul className="list-disc list-inside mt-1 x">
              {image.ticket.map((ticket, index) => (
                <li key={index}>
                  {ticket.type}: {ticket.price}
                </li>
              ))}
            </ul>
          </div>
        </div>
      </footer>
    </div>
  );
};

export default ImageDetailPage;